#include "d/a/e/d_a_e_ks.h"

#include "c/c_lib.h"
#include "c/c_math.h"
#include "common.h"
#include "d/a/d_a_base.h"
#include "d/a/d_a_itembase.h"
#include "d/a/d_a_player.h"
#include "d/a/obj/d_a_obj_base.h"
#include "d/col/bg/d_bg_s.h"
#include "d/col/bg/d_bg_s_gnd_chk.h"
#include "d/col/bg/d_bg_s_lin_chk.h"
#include "d/col/bg/d_bg_s_roof_chk.h"
#include "d/col/bg/d_bg_s_wtr_chk.h"
#include "d/col/c/c_cc_d.h"
#include "d/d_light_env.h"
#include "d/d_pouch.h"
#include "d/snd/d_snd_wzsound.h"
#include "d/t/d_t_ks.h"
#include "f/f_profile_name.h"
#include "m/m3d/m_fanm.h"
#include "m/m_angle.h"
#include "m/m_vec.h"
#include "nw4r/g3d/res/g3d_resanmtexpat.h"
#include "s/s_Math.h"
#include "toBeSorted/attention.h"
#include "toBeSorted/d_emitter.h"
#include "toBeSorted/event_manager.h"
#include "toBeSorted/time_area_mgr.h"

struct dAcEKs_HIO_c {
    f32 _0x00; // 400.0
    s16 _0x04; // 0h
    s16 _0x06; // FFh
    s16 _0x08; // A0h
    s16 _0x0A; // 50h
    s16 _0x0C; // FFh
    s16 _0x0E; // 64h
    s16 _0x10; // FFh
    s16 _0x12; // FFh
    s16 _0x14; // FFh
    f32 _0x18; // 1.2
    f32 _0x1C; // 1.5
    f32 _0x20; // 1.0
    f32 _0x24; // 1.0
    f32 _0x28; // -35.0
    f32 _0x2C; // 30.0
    f32 _0x30; // 1.0
    s16 _0x34; // 71Ch
    s16 _0x36; // 0h
    f32 _0x38; // 30.0
    f32 _0x3C; // 15.0
    f32 _0x40; // 0.0
    f32 _0x44; // 100.0
    f32 _0x48; // 150.0
    f32 _0x4C; // 250.0
    f32 _0x50; // 150.0
    f32 _0x54; // 120.0
    f32 _0x58; // 3.5
    f32 _0x5C; // 3.5
    f32 _0x60; // 3.5
    f32 _0x64; // 10.0
    f32 _0x68; // 20.0
    f32 _0x6C; // 35.0
    f32 _0x70; // 7.0
    f32 _0x74; // 200.0
    f32 _0x78; // 10.0
    f32 _0x7C; // 0.0
    f32 _0x80; // 0.5
    s16 _0x84; // 1555h
    s16 _0x86; // 0h
    f32 _0x88; // 500.0
    f32 _0x8C; // 150.0
    f32 _0x90; // 150.0
    f32 _0x94; // 3000.0
    f32 _0x98; // 120.0
    f32 _0x9C; // 1.0
    s16 _0xA0; // Fh
    s16 _0xA2; // AABh
    f32 _0xA4; // 1.0
    s16 _0xA8; // 1Eh
    s16 _0xAA; // AABh
    f32 _0xAC; // 300.0
    f32 _0xB0; // 3.0
    s16 _0xB4; // 3h
    s16 _0xB6; // 1h
    f32 _0xB8; // 0.0099999998
    f32 _0xBC; // 100.0
    s16 _0xC0; // AABh
    s16 _0xC2; // 0h
    f32 _0xC4; // -0.5

    static const dAcEKs_HIO_c sInstance;
};
const dAcEKs_HIO_c dAcEKs_HIO_c::sInstance = {
    400.0, 0,    0xFF,  0xA0, 0x50,  0xFF,  0x64,  0xFF,  0xFF,   0xFF,  1.2,          1.5,   1.0,   1.0,    -35.0,
    30.0,  1.0,  0x71C, 0,    30.0,  15.0,  0.0,   100.0, 150.0,  250.0, 150.0,        120.0, 3.5,   3.5,    3.5,
    10.0,  20.0, 35.0,  7.0,  200.0, 10.0,  0.0,   0.5,   0x1555, 0x0,   500.0,        150.0, 150.0, 3000.0, 120.0,
    1.0,   0xF,  0xAAB, 1.0,  0x1E,  0xAAB, 300.0, 3.0,   0x3,    0x1,   0.0099999998, 100.0, 0xAAB, 0,      -0.5,
};

SPECIAL_ACTOR_PROFILE(E_KS, dAcEKs_c, fProfile::E_KS, 0xFE, 0, 4099);

STATE_DEFINE(dAcEKs_c, Wait);
STATE_DEFINE(dAcEKs_c, WakeUp);
STATE_DEFINE(dAcEKs_c, ReturnToWait);
STATE_DEFINE(dAcEKs_c, WaitReady);
STATE_DEFINE(dAcEKs_c, Move);
STATE_DEFINE(dAcEKs_c, Chase);
STATE_DEFINE(dAcEKs_c, ChaseAttack);
STATE_DEFINE(dAcEKs_c, Fighting);
STATE_DEFINE(dAcEKs_c, AttackReady);
