#include "d/lyt/d_lyt_shop.h"

#include "common.h"
#include "d/a/d_a_item.h"
#include "d/a/d_a_itembase.h"
#include "d/a/d_a_player.h"
#include "d/d_cs_base.h"
#include "d/d_cs_game.h"
#include "d/d_cursor_hit_check.h"
#include "d/d_message.h"
#include "d/d_pad.h"
#include "d/d_pad_nav.h"
#include "d/d_rumble.h"
#include "d/lyt/d2d.h"
#include "d/lyt/d_lyt_common_icon_item.h"
#include "d/lyt/d_lyt_common_icon_item_maps.h"
#include "d/lyt/d_lyt_common_icon_material.h"
#include "d/lyt/d_lyt_util_items.h"
#include "d/lyt/d_textbox.h"
#include "d/lyt/meter/d_lyt_meter.h"
#include "d/snd/d_snd_small_effect_mgr.h"
#include "d/snd/d_snd_wzsound.h"
#include "f/f_profile.h"
#include "m/m_pad.h"
#include "nw4r/lyt/lyt_group.h"
#include "nw4r/types_nw4r.h"
#include "sized_string.h"
#include "toBeSorted/arc_managers/layout_arc_manager.h"
#include "toBeSorted/counters/counter.h"

#include <cwchar>

struct ShopUpgradeMaterialCost {
    /* 0x0 */ s16 itemId;
    /* 0x2 */ s16 amount;
};

struct ShopUpgradeCosts {
    /* 0x0 */ s16 newItemId;
    /* 0x2 */ s16 oldItemId;
    /* 0x4 */ s16 price;
    /* 0x6 */ ShopUpgradeMaterialCost matCosts[4];
};

struct ShopUpgradeItemData {
    /* 0x0 */ s32 itemId;
    /* 0x4 */ bool canBeUpgraded;
};

static const ShopUpgradeCosts sGearUpgrades[] = {
    {      ITEM_BANDED_SHIELD,
     ITEM_WOODEN_SHIELD,  30,
     {
     {ITEM_AMBER_RELIC, 2},
     {ITEM_MONSTER_CLAW, 1},
     {ITEM_JELLY_BLOB, 1},
     {-1, -1},
     }},
    {      ITEM_BRACED_SHIELD,
     ITEM_BANDED_SHIELD,  50,
     {
     {ITEM_AMBER_RELIC, 3},
     {ITEM_MONSTER_CLAW, 2},
     {ITEM_TUMBLE_WEED, 2},
     {ITEM_ORNAMENTAL_SKULL, 1},
     }},
    {  ITEM_REINFORCED_SHIELD,
     ITEM_IRON_SHIELD,  50,
     {
     {ITEM_ELDIN_ORE, 2},
     {ITEM_MONSTER_CLAW, 2},
     {ITEM_ORNAMENTAL_SKULL, 2},
     {-1, -1},
     }},
    {   ITEM_FORTIFIED_SHIELD,
     ITEM_REINFORCED_SHIELD, 100,
     {
     {ITEM_ELDIN_ORE, 3},
     {ITEM_MONSTER_CLAW, 3},
     {ITEM_TUMBLE_WEED, 3},
     {ITEM_BLUE_BIRD_FEATHER, 1},
     }},
    {      ITEM_DIVINE_SHIELD,
     ITEM_SACRED_SHIELD, 100,
     {
     {ITEM_DUSK_RELIC, 1},
     {ITEM_BIRD_FEATHER, 2},
     {ITEM_ORNAMENTAL_SKULL, 3},
