#ifndef D_LYT_METER_CONFIGURATION
#define D_LYT_METER_CONFIGURATION

#include "common.h"

class dLytMeterConfiguration_c {
public:
    dLytMeterConfiguration_c();
    virtual ~dLytMeterConfiguration_c();

    static const dLytMeterConfiguration_c *GetInstance() {
        return sInstance;
    }

    s32 getField_0x1D8() const {
        return field_0x1D8;
    }

    s32 getField_0x1DC() const {
        return field_0x1DC;
    }

    s32 getField_0x1E0() const {
        return field_0x1E0;
    }

    s32 getField_0x1E4() const {
        return field_0x1E4;
    }


    static dLytMeterConfiguration_c *sInstance;

    /* 0x004 */ u8 field_0x004;
    /* 0x005 */ u8 field_0x005;
    /* 0x006 */ u8 field_0x006;
    /* 0x007 */ u8 field_0x007;
    /* 0x008 */ u8 field_0x008;
    /* 0x009 */ u8 field_0x009;
    /* 0x00A */ u8 field_0x00A;
    /* 0x00B */ u8 field_0x00B;
    /* 0x00C */ f32 field_0x00C;
    /* 0x010 */ u8 field_0x010;
    /* 0x011 */ u8 field_0x011;
    /* 0x012 */ u8 field_0x012;
    /* 0x013 */ u8 field_0x013;
    /* 0x014 */ f32 field_0x014;
    /* 0x018 */ f32 field_0x018;
    /* 0x01C */ u8 field_0x01C;
    /* 0x01D */ u8 field_0x01D;
    /* 0x01E */ u8 field_0x01E;
    /* 0x01F */ u8 field_0x01F;
    /* 0x020 */ s32 field_0x020;
    /* 0x024 */ s32 field_0x024;
    /* 0x028 */ u8 field_0x028;
    /* 0x029 */ u8 field_0x029;
    /* 0x02A */ u8 field_0x02A;
    /* 0x02B */ u8 field_0x02B;
    /* 0x02C */ s32 field_0x02C[16];
    /* 0x06C */ s32 field_0x06C[16];
    /* 0x0AC */ f32 field_0x0AC[16];
    /* 0x0EC */ u8 field_0x0EC[16];
    /* 0x0FC */ u8 field_0x0FC;
    /* 0x0FD */ u8 field_0x0FD;
    /* 0x0FE */ u8 field_0x0FE;
    /* 0x0FF */ u8 field_0x0FF;
    /* 0x100 */ s32 field_0x100[8];
    /* 0x121 */ u8 field_0x121;
    /* 0x124 */ f32 field_0x124;
    /* 0x128 */ f32 field_0x128;
    /* 0x12C */ f32 field_0x12C;
    /* 0x130 */ f32 field_0x130;
    /* 0x134 */ u8 field_0x134;
    /* 0x135 */ u8 field_0x135;
    /* 0x138 */ f32 field_0x138;
    /* 0x13C */ u8 field_0x13C;
    /* 0x140 */ f32 field_0x140;
    /* 0x144 */ f32 field_0x144;
    /* 0x148 */ f32 field_0x148;
    /* 0x14C */ f32 field_0x14C;
    /* 0x150 */ f32 field_0x150;
    /* 0x154 */ f32 field_0x154;
    /* 0x158 */ f32 field_0x158;
    /* 0x15C */ f32 field_0x15C;
    /* 0x160 */ f32 field_0x160;
    /* 0x164 */ u8 field_0x164;
    /* 0x168 */ f32 field_0x168;
    /* 0x16C */ f32 field_0x16C;
    /* 0x170 */ f32 field_0x170;
    /* 0x174 */ f32 field_0x174;
    /* 0x178 */ f32 field_0x178;
    /* 0x17C */ f32 field_0x17C;
    /* 0x180 */ f32 field_0x180;
    /* 0x184 */ f32 field_0x184;
    /* 0x188 */ f32 field_0x188;
    /* 0x18C */ f32 field_0x18C;
    /* 0x190 */ f32 field_0x190;
    /* 0x194 */ f32 field_0x194;
    /* 0x198 */ f32 field_0x198;
    /* 0x19C */ f32 field_0x19C;
    /* 0x1A0 */ f32 field_0x1A0;
    /* 0x1A4 */ f32 field_0x1A4;
    /* 0x1A8 */ f32 field_0x1A8;
    /* 0x1AC */ f32 field_0x1AC;
    /* 0x1B0 */ u8 field_0x1B0;
    /* 0x1B1 */ u8 field_0x1B1;
    /* 0x1B4 */ f32 field_0x1B4;
    /* 0x1B8 */ f32 field_0x1B8;
    /* 0x1BC */ u8 field_0x1BC;
    /* 0x1C0 */ f32 field_0x1C0;
    /* 0x1C4 */ f32 field_0x1C4;
    /* 0x1C8 */ u32 field_0x1C8;
    /* 0x1CC */ f32 field_0x1CC;
    /* 0x1D0 */ f32 field_0x1D0;
    /* 0x1D4 */ u8 field_0x1D4;
    /* 0x1D5 */ u8 field_0x1D5;
    /* 0x1D6 */ u8 field_0x1D6;
    /* 0x1D7 */ u8 field_0x1D7;
    /* 0x1D8 */ s32 field_0x1D8;
    /* 0x1D8 */ s32 field_0x1DC;
    /* 0x1D8 */ s32 field_0x1E0;
    /* 0x1D8 */ s32 field_0x1E4;
};

#endif
